import React from 'react';
import '../styles/about.css';

export default function About() {
  return (
    <div className="about-container">
      <h2>אודות Re-Pro</h2>
      <div className="about-content">
        <section className="about-section">
          <h3>מי אנחנו</h3>
            <p>
              Re-Pro היא חברה מקצועית ובעלת ניסיון רב בתחום השמת עובדים למשרות בחו"ל.<br/>
              אנו מתמחים בקישור בין עסקים ומעסיקים במדינות שונות לבין אנשי מקצוע ישראליים שמחפשים הזדמנויות תעסוקה בינלאומיות.<br/>
              תפקידנו הוא לספק פתרונות מיידיים ויעילים הן למעסיקים המבקשים למצוא את המועמדים המתאימים והן למועמדים המחפשים את הזדמנות הקריירה הבאה שלהם בחו"ל.<br/>
              ב-Re-Pro אנו רואים את עצמנו כמגשרים חשובים בתהליך ההתאמה בין דרישות השוק הגלובלי לציפיות של אנשי מקצוע ישראליים.<br/>
              אנו מבינים שהמעבר לעבודות בינלאומיות מצריך תהליך מדויק ומורכב, ולכן אנו מספקים ליווי מקצועי ואישי לכל שלב בתהליך. מהשלב הראשוני של זיהוי הזדמנויות תעסוקה מתאימות ועד לתהליך ההשתלבות המלא בעבודה, צוות המומחים שלנו כאן כדי להנחות ולתמוך בכל שלב.
            </p>
        </section>

        <section className="about-section">
          <h3>החזון שלנו</h3>
          <p>
            אנו מאמינים כי לכל אדם מגיעה ההזדמנות לעבוד במגוון מקומות בינלאומיים, ואנחנו כאן כדי לסייע לכם להגשים את החלום הזה.
          </p>
        </section>

        <section className="about-section">
          <h3>הליווי שלנו</h3>
          <p>
            ב-Re-Pro, אנו מבינים כי תהליך החיפוש אחרי עבודה בחו"ל עשוי להיות מורכב, ולכן אנו מציעים ליווי מקצועי וכולל לכל מועמד. אנו מסייעים בזיהוי המשרות המתאימות, הכנה לראיונות, ואף בתהליך ההשתלבות בעבודה המיועדת.
          </p>
        </section>

        <section className="about-section">
          <h3>הייחודיות שלנו</h3>
          <p>
            אנו מתמקדים בקידום חברות המחפשות עובדים מצוינים בתחומים שונים. בעזרת טכנולוגיות מתקדמות ושיטות עבודה מוכרות, אנו מסייעים במציאת מועמדים מתאימים העונים על דרישות השוק.
          </p>
        </section>

        <section className="about-section">
          <h3>המחויבות שלנו</h3>
          <p>
            המשימה שלנו היא לקשר בין עסקים למועמדים באופן שיבטיח התאמה מושלמת לצרכים של שני הצדדים. אנו מחויבים לשיפור מתמיד של השירות שלנו, ואתם יכולים להיות בטוחים שביכולתנו לתמוך בכם לאורך כל התהליך.
          </p>
        </section>
      </div>
      <button className="info-button">צור קשר</button>
    </div>
  );
}